<h1 id="tocheading">Table of Contents</h1>
<div id="toc"></div>

In [1]:
%%javascript
$.getScript('https://kmahelona.github.io/ipython_notebook_goodies/ipython_notebook_toc.js')

### 1173. Immediate Food Delivery I

Table: Delivery
+-----------------------------+---------+
| Column Name                 | Type    |
+-----------------------------+---------+
| delivery_id                 | int     |
| customer_id                 | int     |
| order_date                  | date    |
| customer_pref_delivery_date | date    |
+-----------------------------+---------+
delivery_id is the primary key of this table.
The table holds information about food delivery to customers that make orders at some date and specify a preferred delivery date (on the same order date or after it).

If the preferred delivery date of the customer is the same as the order date then the order is called immediate otherwise it's called scheduled.
Write an SQL query to find the percentage of immediate orders in the table, rounded to 2 decimal places.
The query result format is in the following example:
Delivery table:
+-------------+-------------+------------+-----------------------------+
| delivery_id | customer_id | order_date | customer_pref_delivery_date |
+-------------+-------------+------------+-----------------------------+
| 1           | 1           | 2019-08-01 | 2019-08-02                  |
| 2           | 5           | 2019-08-02 | 2019-08-02                  |
| 3           | 1           | 2019-08-11 | 2019-08-11                  |
| 4           | 3           | 2019-08-24 | 2019-08-26                  |
| 5           | 4           | 2019-08-21 | 2019-08-22                  |
| 6           | 2           | 2019-08-11 | 2019-08-13                  |
+-------------+-------------+------------+-----------------------------+
Result table:
+----------------------+
| immediate_percentage |
+----------------------+
| 33.33                |
+----------------------+
The orders with delivery id 2 and 3 are immediate while the others are scheduled.

```mysql
-- CASE
/*SELECT ROUND(SUM(immediate)/COUNT(immediate)*100, 2) AS immediate_percentage
FROM (
    SELECT delivery_id,
        CASE WHEN order_date=customer_pref_delivery_date THEN 1 ELSE 0 END AS immediate
    FROM delivery) a*/
-- IF
SELECT ROUND(SUM(imm) / COUNT(delivery_id) * 100, 2) immediate_percentage
FROM (
    SELECT delivery_id, IF(order_date=customer_pref_delivery_date, 1, 0) AS imm
    FROM Delivery) AS x
```

### 1174. Immediate Food Delivery II

Table: Delivery
+-----------------------------+---------+
| Column Name                 | Type    |
+-----------------------------+---------+
| delivery_id                 | int     |
| customer_id                 | int     |
| order_date                  | date    |
| customer_pref_delivery_date | date    |
+-----------------------------+---------+
delivery_id is the primary key of this table.
The table holds information about food delivery to customers that make orders at some date and specify a preferred delivery date (on the same order date or after it).

If the preferred delivery date of the customer is the same as the order date then the order is called immediate otherwise it's called scheduled.
The first order of a customer is the order with the earliest order date that customer made. It is guaranteed that a customer has exactly one first order.

Write an SQL query to find the percentage of immediate orders in the first orders of all customers, rounded to 2 decimal places.
The query result format is in the following example:
Delivery table:
+-------------+-------------+------------+-----------------------------+
| delivery_id | customer_id | order_date | customer_pref_delivery_date |
+-------------+-------------+------------+-----------------------------+
| 1           | 1           | 2019-08-01 | 2019-08-02                  |
| 2           | 2           | 2019-08-02 | 2019-08-02                  |
| 3           | 1           | 2019-08-11 | 2019-08-12                  |
| 4           | 3           | 2019-08-24 | 2019-08-24                  |
| 5           | 3           | 2019-08-21 | 2019-08-22                  |
| 6           | 2           | 2019-08-11 | 2019-08-13                  |
| 7           | 4           | 2019-08-09 | 2019-08-09                  |
+-------------+-------------+------------+-----------------------------+
Result table:
+----------------------+
| immediate_percentage |
+----------------------+
| 50.00                |
+----------------------+
The customer id 1 has a first order with delivery id 1 and it is scheduled.
The customer id 2 has a first order with delivery id 2 and it is immediate.
The customer id 3 has a first order with delivery id 5 and it is scheduled.
The customer id 4 has a first order with delivery id 7 and it is immediate.
Hence, half the customers have immediate first orders.

```mysql
/*SELECT ROUND(SUM(immediate)/COUNT(immediate)*100, 2) AS immediate_percentage
FROM
(
    SELECT CASE WHEN order_date=customer_pref_delivery_date THEN 1 ELSE 0 END AS immediate
    FROM
    (
        SELECT d.customer_id, d.order_date, d.customer_pref_delivery_date
        FROM delivery d
        JOIN (
            SELECT customer_id, MIN(order_date) AS order_date
            FROM delivery
            GROUP BY customer_id) a
        ON d.customer_id=a.customer_id AND d.order_date=a.order_date) b
    ) c */
-- more concise solution
SELECT ROUND(SUM(lookup.a) * 100 / COUNT(*), 2) AS immediate_percentage
FROM (
    SELECT MIN(order_date) = MIN(customer_pref_delivery_date) AS a
    FROM delivery
    GROUP BY customer_id) as lookup
```

### 1179. Reformat Department Table

Table: Department
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| id            | int     |
| revenue       | int     |
| month         | varchar |
+---------------+---------+
(id, month) is the primary key of this table.
The table has information about the revenue of each department per month.
The month has values in ["Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sep","Oct","Nov","Dec"].

Write an SQL query to reformat the table such that there is a department id column and a revenue column for each month.
The query result format is in the following example:
Department table:
+------+---------+-------+
| id   | revenue | month |
+------+---------+-------+
| 1    | 8000    | Jan   |
| 2    | 9000    | Jan   |
| 3    | 10000   | Feb   |
| 1    | 7000    | Feb   |
| 1    | 6000    | Mar   |
+------+---------+-------+
Result table:
+------+-------------+-------------+-------------+-----+-------------+
| id   | Jan_Revenue | Feb_Revenue | Mar_Revenue | ... | Dec_Revenue |
+------+-------------+-------------+-------------+-----+-------------+
| 1    | 8000        | 7000        | 6000        | ... | null        |
| 2    | 9000        | null        | null        | ... | null        |
| 3    | null        | 10000       | null        | ... | null        |
+------+-------------+-------------+-------------+-----+-------------+
Note that the result table has 13 columns (1 for the department id + 12 for the months).

```mysql
-- USE group by and case
/* SELECT id,
    SUM(CASE WHEN month='Jan' THEN revenue ELSE NULL END) AS Jan_Revenue,
    SUM(CASE WHEN month='Feb' THEN revenue ELSE NULL END) AS Feb_Revenue,
    SUM(CASE WHEN month='Mar' THEN revenue ELSE NULL END) AS Mar_Revenue,
    SUM(CASE WHEN month='Apr' THEN revenue ELSE NULL END) AS Apr_Revenue,
    SUM(CASE WHEN month='May' THEN revenue ELSE NULL END) AS May_Revenue,
    SUM(CASE WHEN month='Jun' THEN revenue ELSE NULL END) AS Jun_Revenue,
    SUM(CASE WHEN month='Jul' THEN revenue ELSE NULL END) AS Jul_Revenue,
    SUM(CASE WHEN month='Aug' THEN revenue ELSE NULL END) AS Aug_Revenue,
    SUM(CASE WHEN month='Sep' THEN revenue ELSE NULL END) AS Sep_Revenue,
    SUM(CASE WHEN month='Oct' THEN revenue ELSE NULL END) AS Oct_Revenue,
    SUM(CASE WHEN month='Nov' THEN revenue ELSE NULL END) AS Nov_Revenue,
    SUM(CASE WHEN month='Dec' THEN revenue ELSE NULL END) AS Dec_Revenue
FROM department
GROUP BY id */
-- Use group by and if, seem a little faster
SELECT 
    id,
    sum( if(month = 'Jan', revenue, null) ) as "Jan_Revenue",
    sum( if(month = 'Feb', revenue, null) ) as "Feb_Revenue",
    sum( if(month = 'Mar', revenue, null) ) as "Mar_Revenue",
    sum( if(month = 'Apr', revenue, null) ) as "Apr_Revenue",
    sum( if(month = 'May', revenue, null) ) as "May_Revenue",
    sum( if(month = 'Jun', revenue, null) ) as "Jun_Revenue",
    sum( if(month = 'Jul', revenue, null) ) as "Jul_Revenue",
    sum( if(month = 'Aug', revenue, null) ) as "Aug_Revenue",
    sum( if(month = 'Sep', revenue, null) ) as "Sep_Revenue",
    sum( if(month = 'Oct', revenue, null) ) as "Oct_Revenue",
    sum( if(month = 'Nov', revenue, null) ) as "Nov_Revenue",
    sum( if(month = 'Dec', revenue, null) ) as "Dec_Revenue"
FROM Department
GROUP BY id
```

### 1193. Monthly Transactions I

Table: Transactions
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| id            | int     |
| country       | varchar |
| state         | enum    |
| amount        | int     |
| trans_date    | date    |
+---------------+---------+
id is the primary key of this table.
The table has information about incoming transactions.
The state column is an enum of type ["approved", "declined"].

Write an SQL query to find for each month and country, the number of transactions and their total amount, the number of approved transactions and their total amount.
The query result format is in the following example:
Transactions table:
+------+---------+----------+--------+------------+
| id   | country | state    | amount | trans_date |
+------+---------+----------+--------+------------+
| 121  | US      | approved | 1000   | 2018-12-18 |
| 122  | US      | declined | 2000   | 2018-12-19 |
| 123  | US      | approved | 2000   | 2019-01-01 |
| 124  | DE      | approved | 2000   | 2019-01-07 |
+------+---------+----------+--------+------------+
Result table:
+----------+---------+-------------+----------------+--------------------+-----------------------+
| month    | country | trans_count | approved_count | trans_total_amount | approved_total_amount |
+----------+---------+-------------+----------------+--------------------+-----------------------+
| 2018-12  | US      | 2           | 1              | 3000               | 1000                  |
| 2019-01  | US      | 1           | 1              | 2000               | 2000                  |
| 2019-01  | DE      | 1           | 1              | 2000               | 2000                  |
+----------+---------+-------------+----------------+--------------------+-----------------------+

```mysql
SELECT LEFT(trans_date, 7) AS month, country,
    COUNT(*) AS trans_count,
    SUM(CASE WHEN state='approved' THEN 1 ELSE 0 END) AS approved_count,
    SUM(amount) AS trans_total_amount,
    SUM(CASE WHEN state='approved' THEN amount ELSE 0 END) AS approved_total_amount
FROM transactions
GROUP BY month, country
```

### 1194. Tournament Winners

Table: Players
+-------------+-------+
| Column Name | Type  |
+-------------+-------+
| player_id   | int   |
| group_id    | int   |
+-------------+-------+
player_id is the primary key of this table.
Each row of this table indicates the group of each player.
Table: Matches
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| match_id      | int     |
| first_player  | int     |
| second_player | int     | 
| first_score   | int     |
| second_score  | int     |
+---------------+---------+
match_id is the primary key of this table.
Each row is a record of a match, first_player and second_player contain the player_id of each match.
first_score and second_score contain the number of points of the first_player and second_player respectively.
You may assume that, in each match, players belongs to the same group.

The winner in each group is the player who scored the maximum total points within the group. In the case of a tie, the lowest player_id wins.
Write an SQL query to find the winner in each group.
The query result format is in the following example:
Players table:
+-----------+------------+
| player_id | group_id   |
+-----------+------------+
| 15        | 1          |
| 25        | 1          |
| 30        | 1          |
| 45        | 1          |
| 10        | 2          |
| 35        | 2          |
| 50        | 2          |
| 20        | 3          |
| 40        | 3          |
+-----------+------------+
Matches table:
+------------+--------------+---------------+-------------+--------------+
| match_id   | first_player | second_player | first_score | second_score |
+------------+--------------+---------------+-------------+--------------+
| 1          | 15           | 45            | 3           | 0            |
| 2          | 30           | 25            | 1           | 2            |
| 3          | 30           | 15            | 2           | 0            |
| 4          | 40           | 20            | 5           | 2            |
| 5          | 35           | 50            | 1           | 1            |
+------------+--------------+---------------+-------------+--------------+
Result table:
+-----------+------------+
| group_id  | player_id  |
+-----------+------------+ 
| 1         | 15         |
| 2         | 35         |
| 3         | 40         |
+-----------+------------+

```mysql
-- SQL server
-- use FIRST_VALUE, short code, but slower
/*SELECT DISTINCT group_id,
    FIRST_VALUE(player_id) OVER (PARTITION BY group_id ORDER BY score DESC, player_id) AS player_id
FROM(
    SELECT  group_id, a.first_player AS player_id, SUM(a.first_score) AS score
    FROM (
        SELECT *
        from matches m1
        UNION
        SELECT match_id, second_player AS first_player, first_player AS  second_player,
            second_score AS first_score, first_score AS  second_score
        FROM matches m2) a
    JOIN players p
    ON a.first_player=p.player_id
    GROUP BY group_id, a.first_player) b*/

-- use RANK and rnk=1, faster
SELECT group_id, player_id
FROM (
    SELECT group_id, player_id,
        RANK() OVER (PARTITION BY group_id ORDER BY score DESC, player_id) AS rnk
    FROM(
        SELECT  group_id, a.first_player AS player_id, SUM(a.first_score) AS score
        FROM (
            SELECT *
            from matches m1
            UNION
            SELECT match_id, second_player AS first_player, first_player AS  second_player,
                second_score AS first_score, first_score AS  second_score
            FROM matches m2) a
        JOIN players p
        ON a.first_player=p.player_id
        GROUP BY group_id, a.first_player) b
    ) c
WHERE rnk=1
```

### 1204. Last Person to Fit in the Elevator

Table: Queue
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| person_id   | int     |
| person_name | varchar |
| weight      | int     |
| turn        | int     |
+-------------+---------+
person_id is the primary key column for this table.
This table has the information about all people waiting for an elevator.
The person_id and turn columns will contain all numbers from 1 to n, where n is the number of rows in the table.
The maximum weight the elevator can hold is 1000.

Write an SQL query to find the person_name of the last person who will fit in the elevator without exceeding the weight limit. It is guaranteed that the person who is first in the queue can fit in the elevator.
The query result format is in the following example:
Queue table
+-----------+-------------------+--------+------+
| person_id | person_name       | weight | turn |
+-----------+-------------------+--------+------+
| 5         | George Washington | 250    | 1    |
| 3         | John Adams        | 350    | 2    |
| 6         | Thomas Jefferson  | 400    | 3    |
| 2         | Will Johnliams    | 200    | 4    |
| 4         | Thomas Jefferson  | 175    | 5    |
| 1         | James Elephant    | 500    | 6    |
+-----------+-------------------+--------+------+
Result table
+-------------------+
| person_name       |
+-------------------+
| Thomas Jefferson  |
+-------------------+
Queue table is ordered by turn in the example for simplicity.
In the example George Washington(id 5), John Adams(id 3) and Thomas Jefferson(id 6) will enter the elevator as their weight sum is 250 + 350 + 400 = 1000.
Thomas Jefferson(id 6) is the last person to fit in the elevator because he has the last turn in these three people.

```mysql
-- MYSQL
# note have duplicate name, therefore group by id and name
SELECT person_name
FROM (
    SELECT q1.person_id, q1.person_name,
        SUM(q2.weight) AS cum_sum
    FROM queue q1, queue q2
    WHERE q2.turn<=q1.turn
    GROUP BY q1.person_id, q1.person_name
    HAVING cum_sum<=1000
    ) a
ORDER BY cum_sum DESC
LIMIT 1

-- SQL server
SELECT TOP 1 person_name
FROM
    (SELECT person_name,
        SUM(weight) OVER (ORDER BY turn) AS cum_sum
    FROM queue) a
WHERE cum_sum<=1000
ORDER BY cum_sum DESC
```

### 1205. Monthly Transactions II

Table: Transactions
+----------------+---------+
| Column Name    | Type    |
+----------------+---------+
| id             | int     |
| country        | varchar |
| state          | enum    |
| amount         | int     |
| trans_date     | date    |
+----------------+---------+
id is the primary key of this table.
The table has information about incoming transactions.
The state column is an enum of type ["approved", "declined"].
Table: Chargebacks
+----------------+---------+
| Column Name    | Type    |
+----------------+---------+
| trans_id       | int     |
| charge_date    | date    |
+----------------+---------+
Chargebacks contains basic information regarding incoming chargebacks from some transactions placed in Transactions table.
trans_id is a foreign key to the id column of Transactions table.
Each chargeback corresponds to a transaction made previously even if they were not approved.

Write an SQL query to find for each month and country, the number of approved transactions and their total amount, the number of chargebacks and their total amount.
Note: In your query, given the month and country, ignore rows with all zeros.
The query result format is in the following example:
Transactions table:
+------+---------+----------+--------+------------+
| id   | country | state    | amount | trans_date |
+------+---------+----------+--------+------------+
| 101  | US      | approved | 1000   | 2019-05-18 |
| 102  | US      | declined | 2000   | 2019-05-19 |
| 103  | US      | approved | 3000   | 2019-06-10 |
| 104  | US      | approved | 4000   | 2019-06-13 |
| 105  | US      | approved | 5000   | 2019-06-15 |
+------+---------+----------+--------+------------+
Chargebacks table:
+------------+------------+
| trans_id   | trans_date |
+------------+------------+
| 102        | 2019-05-29 |
| 101        | 2019-06-30 |
| 105        | 2019-09-18 |
+------------+------------+
Result table:
+----------+---------+----------------+-----------------+-------------------+--------------------+
| month    | country | approved_count | approved_amount | chargeback_count  | chargeback_amount  |
+----------+---------+----------------+-----------------+-------------------+--------------------+
| 2019-05  | US      | 1              | 1000            | 1                 | 2000               |
| 2019-06  | US      | 3              | 12000           | 1                 | 1000               |
| 2019-09  | US      | 0              | 0               | 1                 | 5000               |
+----------+---------+----------------+-----------------+-------------------+--------------------+

```mysql
-- MYSQL
-- LEFT JOIN + UNION + RIGHT JOIN === OUTER JOIN
SELECT COALESCE(a.month, b.month) AS month, COALESCE(a.country, b.country) AS country,
    IFNULL(approved_count, 0) AS approved_count, IFNULL(approved_amount, 0) AS approved_amount,
    IFNULL(chargeback_count, 0) AS chargeback_count, IFNULL(chargeback_amount, 0) AS chargeback_amount
FROM (
    SELECT SUBSTR(trans_date, 1, 7) AS month, country,
        COUNT(id) AS approved_count, SUM(amount) AS approved_amount
    FROM transactions
    WHERE state='approved'
    GROUP BY month, country) a
LEFT JOIN (
    SELECT SUBSTR(c.trans_date, 1, 7) AS month, country,
        COUNT(trans_id) AS chargeback_count, SUM(amount) AS chargeback_amount
    FROM transactions t
    JOIN chargebacks c
    ON t.id=c.trans_id
    GROUP BY month, country) b
ON a.month=b.month AND a.country=b.country
UNION
SELECT COALESCE(a.month, b.month) AS month, COALESCE(a.country, b.country) AS country,
    IFNULL(approved_count, 0) AS approved_count, IFNULL(approved_amount, 0) AS approved_amount,
    IFNULL(chargeback_count, 0) AS chargeback_count, IFNULL(chargeback_amount, 0) AS chargeback_amount
FROM (
    SELECT SUBSTR(trans_date, 1, 7) AS month, country,
        COUNT(id) AS approved_count, SUM(amount) AS approved_amount
    FROM transactions
    WHERE state='approved'
    GROUP BY month, country) a
RIGHT JOIN (
    SELECT SUBSTR(c.trans_date, 1, 7) AS month, country,
        COUNT(trans_id) AS chargeback_count, SUM(amount) AS chargeback_amount
    FROM transactions t
    JOIN chargebacks c
    ON t.id=c.trans_id
    GROUP BY month, country) b
ON a.month=b.month AND a.country=b.country

-- SQL server
SELECT COALESCE(a.month, b.month) AS month,
    COALESCE(a.country, b.country) AS country,
    ISNULL(approved_count, 0) AS approved_count,
    ISNULL(approved_amount, 0) AS approved_amount,
    ISNULL(chargeback_count, 0) AS chargeback_count,
    ISNULL(chargeback_amount, 0) AS chargeback_amount
FROM (
    SELECT LEFT(trans_date, 7) AS month, country,
        COUNT(id) AS approved_count,
        SUM(amount) AS approved_amount
    FROM transactions
    WHERE state='approved'
    GROUP BY LEFT(trans_date, 7), country
) a
FULL OUTER JOIN (
    SELECT LEFT(c.trans_date, 7) AS month, country,
        COUNT(trans_id) AS chargeback_count,
        SUM(amount) AS chargeback_amount
    FROM transactions t
    JOIN chargebacks c
    ON t.id=c.trans_id
    GROUP BY LEFT(c.trans_date, 7), country
) b
ON a.month=b.month AND a.country=b.country
```

### 1211. Queries Quality and Percentage

Table: Queries
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| query_name  | varchar |
| result      | varchar |
| position    | int     |
| rating      | int     |
+-------------+---------+
There is no primary key for this table, it may have duplicate rows.
This table contains information collected from some queries on a database.
The position column has a value from 1 to 500.
The rating column has a value from 1 to 5. Query with rating less than 3 is a poor query.

We define query quality as:
The average of the ratio between query rating and its position.
We also define poor query percentage as:
The percentage of all queries with rating less than 3.

Write an SQL query to find each query_name, the quality and poor_query_percentage.
Both quality and poor_query_percentage should be rounded to 2 decimal places.
The query result format is in the following example:
Queries table:
+------------+-------------------+----------+--------+
| query_name | result            | position | rating |
+------------+-------------------+----------+--------+
| Dog        | Golden Retriever  | 1        | 5      |
| Dog        | German Shepherd   | 2        | 5      |
| Dog        | Mule              | 200      | 1      |
| Cat        | Shirazi           | 5        | 2      |
| Cat        | Siamese           | 3        | 3      |
| Cat        | Sphynx            | 7        | 4      |
+------------+-------------------+----------+--------+
Result table:
+------------+---------+-----------------------+
| query_name | quality | poor_query_percentage |
+------------+---------+-----------------------+
| Dog        | 2.50    | 33.33                 |
| Cat        | 0.66    | 33.33                 |
+------------+---------+-----------------------+
Dog queries quality is ((5 / 1) + (5 / 2) + (1 / 200)) / 3 = 2.50
Dog queries poor_ query_percentage is (1 / 3) * 100 = 33.33

Cat queries quality equals ((2 / 5) + (3 / 3) + (4 / 7)) / 3 = 0.66
Cat queries poor_ query_percentage is (1 / 3) * 100 = 33.33

```mysql
SELECT query_name, ROUND(AVG(rating/position), 2) AS quality,
    ROUND(SUM(IF(rating<3, 1, 0))/COUNT(rating)*100, 2) AS poor_query_percentage
FROM queries
GROUP BY query_name
```

### 1212. Team Scores in Football Tournament

Table: Teams
+---------------+----------+
| Column Name   | Type     |
+---------------+----------+
| team_id       | int      |
| team_name     | varchar  |
+---------------+----------+
team_id is the primary key of this table.
Each row of this table represents a single football team.
Table: Matches
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| match_id      | int     |
| host_team     | int     |
| guest_team    | int     | 
| host_goals    | int     |
| guest_goals   | int     |
+---------------+---------+
match_id is the primary key of this table.
Each row is a record of a finished match between two different teams. 
Teams host_team and guest_team are represented by their IDs in the teams table (team_id) and they scored host_goals and guest_goals goals respectively.

You would like to compute the scores of all teams after all matches. Points are awarded as follows:
A team receives three points if they win a match (Score strictly more goals than the opponent team).
A team receives one point if they draw a match (Same number of goals as the opponent team).
A team receives no points if they lose a match (Score less goals than the opponent team).
Write an SQL query that selects the team_id, team_name and num_points of each team in the tournament after all described matches. Result table should be ordered by num_points (decreasing order). In case of a tie, order the records by team_id (increasing order).

The query result format is in the following example:
Teams table:
+-----------+--------------+
| team_id   | team_name    |
+-----------+--------------+
| 10        | Leetcode FC  |
| 20        | NewYork FC   |
| 30        | Atlanta FC   |
| 40        | Chicago FC   |
| 50        | Toronto FC   |
+-----------+--------------+
Matches table:
+------------+--------------+---------------+-------------+--------------+
| match_id   | host_team    | guest_team    | host_goals  | guest_goals  |
+------------+--------------+---------------+-------------+--------------+
| 1          | 10           | 20            | 3           | 0            |
| 2          | 30           | 10            | 2           | 2            |
| 3          | 10           | 50            | 5           | 1            |
| 4          | 20           | 30            | 1           | 0            |
| 5          | 50           | 30            | 1           | 0            |
+------------+--------------+---------------+-------------+--------------+
Result table:
+------------+--------------+---------------+
| team_id    | team_name    | num_points    |
+------------+--------------+---------------+
| 10         | Leetcode FC  | 7             |
| 20         | NewYork FC   | 3             |
| 50         | Toronto FC   | 3             |
| 30         | Atlanta FC   | 1             |
| 40         | Chicago FC   | 0             |
+------------+--------------+---------------+

```mysql
SELECT t.team_id, t.team_name,
    IFNULL(SUM(points), 0) AS num_points
FROM teams t
LEFT JOIN
(SELECT host_team AS team_id,
    CASE WHEN host_goals>guest_goals THEN 3
        WHEN host_goals=guest_goals THEN 1
        ELSE 0 END as points
FROM matches
UNION ALL
SELECT guest_team AS team_id,
    CASE WHEN host_goals>guest_goals THEN 0
        WHEN host_goals=guest_goals THEN 1
        ELSE 3 END as points
FROM matches) a
ON t.team_id=a.team_id
GROUP BY t.team_id, t.team_name
ORDER BY num_points DESC, t.team_id
```

### 1225. Report Contiguous Dates

Table: Failed
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| fail_date    | date    |
+--------------+---------+
Primary key for this table is fail_date.
Failed table contains the days of failed tasks.
Table: Succeeded
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| success_date | date    |
+--------------+---------+
Primary key for this table is success_date.
Succeeded table contains the days of succeeded tasks.

A system is running one task every day. Every task is independent of the previous tasks. The tasks can fail or succeed.
Write an SQL query to generate a report of period_state for each continuous interval of days in the period from 2019-01-01 to 2019-12-31.
period_state is 'failed' if tasks in this interval failed or 'succeeded' if tasks in this interval succeeded. Interval of days are retrieved as start_date and end_date.
Order result by start_date.

The query result format is in the following example:
Failed table:
+-------------------+
| fail_date         |
+-------------------+
| 2018-12-28        |
| 2018-12-29        |
| 2019-01-04        |
| 2019-01-05        |
+-------------------+
Succeeded table:
+-------------------+
| success_date      |
+-------------------+
| 2018-12-30        |
| 2018-12-31        |
| 2019-01-01        |
| 2019-01-02        |
| 2019-01-03        |
| 2019-01-06        |
+-------------------+
Result table:
+--------------+--------------+--------------+
| period_state | start_date   | end_date     |
+--------------+--------------+--------------+
| succeeded    | 2019-01-01   | 2019-01-03   |
| failed       | 2019-01-04   | 2019-01-05   |
| succeeded    | 2019-01-06   | 2019-01-06   |
+--------------+--------------+--------------+

The report ignored the system state in 2018 as we care about the system in the period 2019-01-01 to 2019-12-31.
From 2019-01-01 to 2019-01-03 all tasks succeeded and the system state was "succeeded".
From 2019-01-04 to 2019-01-05 all tasks failed and system state was "failed".
From 2019-01-06 to 2019-01-06 all tasks succeeded and system state was "succeeded".

```mysql
SELECT *
FROM (
SELECT 'failed' AS period_state, start_date, MIN(end_date) AS end_date
FROM (
    SELECT fail_date AS start_date
    FROM failed
    WHERE fail_date BETWEEN '2019-01-01' AND '2019-12-31'
        AND fail_date NOT IN (
        SELECT ADDDATE(fail_date, INTERVAL 1 DAY)
        FROM failed
        WHERE fail_date BETWEEN '2019-01-01' AND '2019-12-31')
    ) a
CROSS JOIN (
    SELECT fail_date AS end_date
    FROM failed
    WHERE fail_date BETWEEN '2019-01-01' AND '2019-12-31'
        AND fail_date NOT IN (
        SELECT ADDDATE(fail_date, INTERVAL -1 DAY)
        FROM failed
        WHERE fail_date BETWEEN '2019-01-01' AND '2019-12-31')
    ) b
ON start_date<=end_date
GROUP BY start_date
UNION
SELECT 'succeeded' AS period_state, start_date, MIN(end_date) AS end_date
FROM (
    SELECT success_date AS start_date
    FROM succeeded
    WHERE success_date BETWEEN '2019-01-01' AND '2019-12-31'
        AND success_date NOT IN (
        SELECT ADDDATE(success_date, INTERVAL 1 DAY)
        FROM succeeded
        WHERE success_date BETWEEN '2019-01-01' AND '2019-12-31')
    ) a
CROSS JOIN (
    SELECT success_date AS end_date
    FROM succeeded
    WHERE success_date BETWEEN '2019-01-01' AND '2019-12-31'
        AND success_date NOT IN (
        SELECT ADDDATE(success_date, INTERVAL -1 DAY)
        FROM succeeded
        WHERE success_date BETWEEN '2019-01-01' AND '2019-12-31')
    ) b
ON start_date<=end_date
GROUP BY start_date) X
ORDER BY start_date
```

### 1241. Number of Comments per Post

Table: Submissions
+---------------+----------+
| Column Name   | Type     |
+---------------+----------+
| sub_id        | int      |
| parent_id     | int      |
+---------------+----------+
There is no primary key for this table, it may have duplicate rows.
Each row can be a post or comment on the post.
parent_id is null for posts.
parent_id for comments is sub_id for another post in the table.

Write an SQL query to find number of comments per each post.
Result table should contain post_id and its corresponding number_of_comments, and must be sorted by post_id in ascending order.
Submissions may contain duplicate comments. You should count the number of unique comments per post.
Submissions may contain duplicate posts. You should treat them as one post.

The query result format is in the following example:
Submissions table:
+---------+------------+
| sub_id  | parent_id  |
+---------+------------+
| 1       | Null       |
| 2       | Null       |
| 1       | Null       |
| 12      | Null       |
| 3       | 1          |
| 5       | 2          |
| 3       | 1          |
| 4       | 1          |
| 9       | 1          |
| 10      | 2          |
| 6       | 7          |
+---------+------------+
Result table:
+---------+--------------------+
| post_id | number_of_comments |
+---------+--------------------+
| 1       | 3                  |
| 2       | 2                  |
| 12      | 0                  |
+---------+--------------------+

The post with id 1 has three comments in the table with id 3, 4 and 9. The comment with id 3 is repeated in the table, we counted it only once.
The post with id 2 has two comments in the table with id 5 and 10.
The post with id 12 has no comments in the table.
The comment with id 6 is a comment on a deleted post with id 7 so we ignored it.

```mysql
SELECT post_id, COUNT(DISTINCT sub_id) AS number_of_comments
FROM (
    SELECT DISTINCT sub_id AS post_id
    FROM submissions
    WHERE parent_id IS NULL) a
LEFT JOIN submissions s
ON post_id=parent_id
GROUP BY post_id
ORDER BY post_id
```

### 1251. Average Selling Price

Table: Prices
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| product_id    | int     |
| start_date    | date    |
| end_date      | date    |
| price         | int     |
+---------------+---------+
(product_id, start_date, end_date) is the primary key for this table.
Each row of this table indicates the price of the product_id in the period from start_date to end_date.
For each product_id there will be no two overlapping periods. That means there will be no two intersecting periods for the same product_id.
Table: UnitsSold
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| product_id    | int     |
| purchase_date | date    |
| units         | int     |
+---------------+---------+
There is no primary key for this table, it may contain duplicates.
Each row of this table indicates the date, units and product_id of each product sold. 

Write an SQL query to find the average selling price for each product.
average_price should be rounded to 2 decimal places.
The query result format is in the following example:
Prices table:
+------------+------------+------------+--------+
| product_id | start_date | end_date   | price  |
+------------+------------+------------+--------+
| 1          | 2019-02-17 | 2019-02-28 | 5      |
| 1          | 2019-03-01 | 2019-03-22 | 20     |
| 2          | 2019-02-01 | 2019-02-20 | 15     |
| 2          | 2019-02-21 | 2019-03-31 | 30     |
+------------+------------+------------+--------+
UnitsSold table:
+------------+---------------+-------+
| product_id | purchase_date | units |
+------------+---------------+-------+
| 1          | 2019-02-25    | 100   |
| 1          | 2019-03-01    | 15    |
| 2          | 2019-02-10    | 200   |
| 2          | 2019-03-22    | 30    |
+------------+---------------+-------+
Result table:
+------------+---------------+
| product_id | average_price |
+------------+---------------+
| 1          | 6.96          |
| 2          | 16.96         |
+------------+---------------+
Average selling price = Total Price of Product / Number of products sold.
Average selling price for product 1 = ((100 * 5) + (15 * 20)) / 115 = 6.96
Average selling price for product 2 = ((200 * 15) + (30 * 30)) / 230 = 16.96

```mysql
SELECT u.product_id, ROUND(SUM(p.price*u.units)/SUM(u.units), 2) AS average_price
FROM prices p
JOIN (SELECT DISTINCT * FROM unitssold) u
ON p.product_id=u.product_id AND u.purchase_date BETWEEN p.start_date AND p.end_date
GROUP BY u.product_id
```